espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cmu.h
/* Bit fields for CMU CLKEN1 */
#define _CMU_CLKEN1_RESETVALUE                     0x00000000UL                              /**< Default value for CMU_CLKEN1                */
#define _CMU_CLKEN1_MASK                           0xF9FFFF00UL                              /**< Mask for CMU_CLKEN1                         */
#define CMU_CLKEN1_HOSTMAILBOX                     (0x1UL << 8)                              /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_HOSTMAILBOX_SHIFT              8                                         /**< Shift value for CMU_HOSTMAILBOX             */
#define _CMU_CLKEN1_HOSTMAILBOX_MASK               0x100UL                                   /**< Bit mask for CMU_HOSTMAILBOX                */
#define _CMU_CLKEN1_HOSTMAILBOX_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_HOSTMAILBOX_DEFAULT             (_CMU_CLKEN1_HOSTMAILBOX_DEFAULT << 8)    /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_RFFPLL0                         (0x1UL << 9)                              /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_RFFPLL0_SHIFT                  9                                         /**< Shift value for CMU_RFFPLL0                 */
#define _CMU_CLKEN1_RFFPLL0_MASK                   0x200UL                                   /**< Bit mask for CMU_RFFPLL0                    */
#define _CMU_CLKEN1_RFFPLL0_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_RFFPLL0_DEFAULT                 (_CMU_CLKEN1_RFFPLL0_DEFAULT << 9)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SEMAILBOXHOST                   (0x1UL << 10)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SEMAILBOXHOST_SHIFT            10                                        /**< Shift value for CMU_SEMAILBOXHOST           */
#define _CMU_CLKEN1_SEMAILBOXHOST_MASK             0x400UL                                   /**< Bit mask for CMU_SEMAILBOXHOST              */
#define _CMU_CLKEN1_SEMAILBOXHOST_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SEMAILBOXHOST_DEFAULT           (_CMU_CLKEN1_SEMAILBOXHOST_DEFAULT << 10) /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_BUFC                            (0x1UL << 11)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_BUFC_SHIFT                     11                                        /**< Shift value for CMU_BUFC                    */
#define _CMU_CLKEN1_BUFC_MASK                      0x800UL                                   /**< Bit mask for CMU_BUFC                       */
#define _CMU_CLKEN1_BUFC_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_BUFC_DEFAULT                    (_CMU_CLKEN1_BUFC_DEFAULT << 11)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART3                         (0x1UL << 12)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART3_SHIFT                  12                                        /**< Shift value for CMU_EUSART3                 */
#define _CMU_CLKEN1_EUSART3_MASK                   0x1000UL                                  /**< Bit mask for CMU_EUSART3                    */
#define _CMU_CLKEN1_EUSART3_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART3_DEFAULT                 (_CMU_CLKEN1_EUSART3_DEFAULT << 12)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART4                         (0x1UL << 13)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART4_SHIFT                  13                                        /**< Shift value for CMU_EUSART4                 */
#define _CMU_CLKEN1_EUSART4_MASK                   0x2000UL                                  /**< Bit mask for CMU_EUSART4                    */
#define _CMU_CLKEN1_EUSART4_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART4_DEFAULT                 (_CMU_CLKEN1_EUSART4_DEFAULT << 13)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_SMU                             (0x1UL << 14)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_SMU_SHIFT                      14                                        /**< Shift value for CMU_SMU                     */
#define _CMU_CLKEN1_SMU_MASK                       0x4000UL                                  /**< Bit mask for CMU_SMU                        */
#define _CMU_CLKEN1_SMU_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_SMU_DEFAULT                     (_CMU_CLKEN1_SMU_DEFAULT << 14)           /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ICACHE0                         (0x1UL << 15)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ICACHE0_SHIFT                  15                                        /**< Shift value for CMU_ICACHE0                 */
#define _CMU_CLKEN1_ICACHE0_MASK                   0x8000UL                                  /**< Bit mask for CMU_ICACHE0                    */
#define _CMU_CLKEN1_ICACHE0_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ICACHE0_DEFAULT                 (_CMU_CLKEN1_ICACHE0_DEFAULT << 15)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_MSC                             (0x1UL << 16)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_MSC_SHIFT                      16                                        /**< Shift value for CMU_MSC                     */
#define _CMU_CLKEN1_MSC_MASK                       0x10000UL                                 /**< Bit mask for CMU_MSC                        */
#define _CMU_CLKEN1_MSC_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_MSC_DEFAULT                     (_CMU_CLKEN1_MSC_DEFAULT << 16)           /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_WDOG1                           (0x1UL << 17)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_WDOG1_SHIFT                    17                                        /**< Shift value for CMU_WDOG1                   */
#define _CMU_CLKEN1_WDOG1_MASK                     0x20000UL                                 /**< Bit mask for CMU_WDOG1                      */
#define _CMU_CLKEN1_WDOG1_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_WDOG1_DEFAULT                   (_CMU_CLKEN1_WDOG1_DEFAULT << 17)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ACMP0                           (0x1UL << 18)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ACMP0_SHIFT                    18                                        /**< Shift value for CMU_ACMP0                   */
#define _CMU_CLKEN1_ACMP0_MASK                     0x40000UL                                 /**< Bit mask for CMU_ACMP0                      */
#define _CMU_CLKEN1_ACMP0_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ACMP0_DEFAULT                   (_CMU_CLKEN1_ACMP0_DEFAULT << 18)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ACMP1                           (0x1UL << 19)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ACMP1_SHIFT                    19                                        /**< Shift value for CMU_ACMP1                   */
#define _CMU_CLKEN1_ACMP1_MASK                     0x80000UL                                 /**< Bit mask for CMU_ACMP1                      */
#define _CMU_CLKEN1_ACMP1_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ACMP1_DEFAULT                   (_CMU_CLKEN1_ACMP1_DEFAULT << 19)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_VDAC0                           (0x1UL << 20)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_VDAC0_SHIFT                    20                                        /**< Shift value for CMU_VDAC0                   */
#define _CMU_CLKEN1_VDAC0_MASK                     0x100000UL                                /**< Bit mask for CMU_VDAC0                      */
#define _CMU_CLKEN1_VDAC0_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_VDAC0_DEFAULT                   (_CMU_CLKEN1_VDAC0_DEFAULT << 20)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_PCNT0                           (0x1UL << 21)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_PCNT0_SHIFT                    21                                        /**< Shift value for CMU_PCNT0                   */
#define _CMU_CLKEN1_PCNT0_MASK                     0x200000UL                                /**< Bit mask for CMU_PCNT0                      */
#define _CMU_CLKEN1_PCNT0_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_PCNT0_DEFAULT                   (_CMU_CLKEN1_PCNT0_DEFAULT << 21)         /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART0                         (0x1UL << 22)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART0_SHIFT                  22                                        /**< Shift value for CMU_EUSART0                 */
#define _CMU_CLKEN1_EUSART0_MASK                   0x400000UL                                /**< Bit mask for CMU_EUSART0                    */
#define _CMU_CLKEN1_EUSART0_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART0_DEFAULT                 (_CMU_CLKEN1_EUSART0_DEFAULT << 22)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART1                         (0x1UL << 23)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART1_SHIFT                  23                                        /**< Shift value for CMU_EUSART1                 */
#define _CMU_CLKEN1_EUSART1_MASK                   0x800000UL                                /**< Bit mask for CMU_EUSART1                    */
#define _CMU_CLKEN1_EUSART1_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART1_DEFAULT                 (_CMU_CLKEN1_EUSART1_DEFAULT << 23)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_EUSART2                         (0x1UL << 24)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_EUSART2_SHIFT                  24                                        /**< Shift value for CMU_EUSART2                 */
#define _CMU_CLKEN1_EUSART2_MASK                   0x1000000UL                               /**< Bit mask for CMU_EUSART2                    */
#define _CMU_CLKEN1_EUSART2_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_EUSART2_DEFAULT                 (_CMU_CLKEN1_EUSART2_DEFAULT << 24)       /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_DMEM                            (0x1UL << 27)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_DMEM_SHIFT                     27                                        /**< Shift value for CMU_DMEM                    */
#define _CMU_CLKEN1_DMEM_MASK                      0x8000000UL                               /**< Bit mask for CMU_DMEM                       */
#define _CMU_CLKEN1_DMEM_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_DMEM_DEFAULT                    (_CMU_CLKEN1_DMEM_DEFAULT << 27)          /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_ETAMPDET                        (0x1UL << 28)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_ETAMPDET_SHIFT                 28                                        /**< Shift value for CMU_ETAMPDET                */
#define _CMU_CLKEN1_ETAMPDET_MASK                  0x10000000UL                              /**< Bit mask for CMU_ETAMPDET                   */
#define _CMU_CLKEN1_ETAMPDET_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_ETAMPDET_DEFAULT                (_CMU_CLKEN1_ETAMPDET_DEFAULT << 28)      /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_TIMER6                          (0x1UL << 29)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_TIMER6_SHIFT                   29                                        /**< Shift value for CMU_TIMER6                  */
#define _CMU_CLKEN1_TIMER6_MASK                    0x20000000UL                              /**< Bit mask for CMU_TIMER6                     */
#define _CMU_CLKEN1_TIMER6_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_TIMER6_DEFAULT                  (_CMU_CLKEN1_TIMER6_DEFAULT << 29)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_TIMER7                          (0x1UL << 30)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_TIMER7_SHIFT                   30                                        /**< Shift value for CMU_TIMER7                  */
#define _CMU_CLKEN1_TIMER7_MASK                    0x40000000UL                              /**< Bit mask for CMU_TIMER7                     */
#define _CMU_CLKEN1_TIMER7_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_TIMER7_DEFAULT                  (_CMU_CLKEN1_TIMER7_DEFAULT << 30)        /**< Shifted mode DEFAULT for CMU_CLKEN1         */
#define CMU_CLKEN1_USB                             (0x1UL << 31)                             /**< Enable Bus Clock                            */
#define _CMU_CLKEN1_USB_SHIFT                      31                                        /**< Shift value for CMU_USB                     */
#define _CMU_CLKEN1_USB_MASK                       0x80000000UL                              /**< Bit mask for CMU_USB                        */
#define _CMU_CLKEN1_USB_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for CMU_CLKEN1                 */
#define CMU_CLKEN1_USB_DEFAULT                     (_CMU_CLKEN1_USB_DEFAULT << 31)           /**< Shifted mode DEFAULT for CMU_CLKEN1         */

