espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_cmu.h
/* Bit fields for CMU RADIOCLKCTRL */
#define _CMU_RADIOCLKCTRL_RESETVALUE               0x00000100UL                                 /**< Default value for CMU_RADIOCLKCTRL          */
#define _CMU_RADIOCLKCTRL_MASK                     0x80000703UL                                 /**< Mask for CMU_RADIOCLKCTRL                   */
#define CMU_RADIOCLKCTRL_EN                        (0x1UL << 0)                                 /**< Enable                                      */
#define _CMU_RADIOCLKCTRL_EN_SHIFT                 0                                            /**< Shift value for CMU_EN                      */
#define _CMU_RADIOCLKCTRL_EN_MASK                  0x1UL                                        /**< Bit mask for CMU_EN                         */
#define _CMU_RADIOCLKCTRL_EN_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for CMU_RADIOCLKCTRL           */
#define CMU_RADIOCLKCTRL_EN_DEFAULT                (_CMU_RADIOCLKCTRL_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for CMU_RADIOCLKCTRL   */
#define _CMU_RADIOCLKCTRL_CLKSEL_SHIFT             8                                            /**< Shift value for CMU_CLKSEL                  */
#define _CMU_RADIOCLKCTRL_CLKSEL_MASK              0x700UL                                      /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_RADIOCLKCTRL_CLKSEL_DEFAULT           0x00000001UL                                 /**< Mode DEFAULT for CMU_RADIOCLKCTRL           */
#define _CMU_RADIOCLKCTRL_CLKSEL_FSRCO             0x00000001UL                                 /**< Mode FSRCO for CMU_RADIOCLKCTRL             */
#define _CMU_RADIOCLKCTRL_CLKSEL_RFFPLL0RADIO      0x00000002UL                                 /**< Mode RFFPLL0RADIO for CMU_RADIOCLKCTRL      */
#define _CMU_RADIOCLKCTRL_CLKSEL_HFXO              0x00000003UL                                 /**< Mode HFXO for CMU_RADIOCLKCTRL              */
#define CMU_RADIOCLKCTRL_CLKSEL_DEFAULT            (_CMU_RADIOCLKCTRL_CLKSEL_DEFAULT << 8)      /**< Shifted mode DEFAULT for CMU_RADIOCLKCTRL   */
#define CMU_RADIOCLKCTRL_CLKSEL_FSRCO              (_CMU_RADIOCLKCTRL_CLKSEL_FSRCO << 8)        /**< Shifted mode FSRCO for CMU_RADIOCLKCTRL     */
#define CMU_RADIOCLKCTRL_CLKSEL_RFFPLL0RADIO       (_CMU_RADIOCLKCTRL_CLKSEL_RFFPLL0RADIO << 8) /**< Shifted mode RFFPLL0RADIO for CMU_RADIOCLKCTRL*/
#define CMU_RADIOCLKCTRL_CLKSEL_HFXO               (_CMU_RADIOCLKCTRL_CLKSEL_HFXO << 8)         /**< Shifted mode HFXO for CMU_RADIOCLKCTRL      */
#define CMU_RADIOCLKCTRL_DBGCLK                    (0x1UL << 31)                                /**< Enable Clock for Debugger                   */
#define _CMU_RADIOCLKCTRL_DBGCLK_SHIFT             31                                           /**< Shift value for CMU_DBGCLK                  */
#define _CMU_RADIOCLKCTRL_DBGCLK_MASK              0x80000000UL                                 /**< Bit mask for CMU_DBGCLK                     */
#define _CMU_RADIOCLKCTRL_DBGCLK_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for CMU_RADIOCLKCTRL           */
#define CMU_RADIOCLKCTRL_DBGCLK_DEFAULT            (_CMU_RADIOCLKCTRL_DBGCLK_DEFAULT << 31)     /**< Shifted mode DEFAULT for CMU_RADIOCLKCTRL   */

/* Bit fields for CMU DAPCLKCTRL */
#define _CMU_DAPCLKCTRL_RESETVALUE                 0x00000001UL                            /**< Default value for CMU_DAPCLKCTRL            */
#define _CMU_DAPCLKCTRL_MASK                       0x00000003UL                            /**< Mask for CMU_DAPCLKCTRL                     */
#define _CMU_DAPCLKCTRL_CLKSEL_SHIFT               0                                       /**< Shift value for CMU_CLKSEL                  */
#define _CMU_DAPCLKCTRL_CLKSEL_MASK                0x3UL                                   /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_DAPCLKCTRL_CLKSEL_DEFAULT             0x00000001UL                            /**< Mode DEFAULT for CMU_DAPCLKCTRL             */
#define _CMU_DAPCLKCTRL_CLKSEL_DISABLED            0x00000000UL                            /**< Mode DISABLED for CMU_DAPCLKCTRL            */
#define _CMU_DAPCLKCTRL_CLKSEL_FSRCO               0x00000001UL                            /**< Mode FSRCO for CMU_DAPCLKCTRL               */
#define _CMU_DAPCLKCTRL_CLKSEL_HFRCODPLL           0x00000002UL                            /**< Mode HFRCODPLL for CMU_DAPCLKCTRL           */
#define CMU_DAPCLKCTRL_CLKSEL_DEFAULT              (_CMU_DAPCLKCTRL_CLKSEL_DEFAULT << 0)   /**< Shifted mode DEFAULT for CMU_DAPCLKCTRL     */
#define CMU_DAPCLKCTRL_CLKSEL_DISABLED             (_CMU_DAPCLKCTRL_CLKSEL_DISABLED << 0)  /**< Shifted mode DISABLED for CMU_DAPCLKCTRL    */
#define CMU_DAPCLKCTRL_CLKSEL_FSRCO                (_CMU_DAPCLKCTRL_CLKSEL_FSRCO << 0)     /**< Shifted mode FSRCO for CMU_DAPCLKCTRL       */
#define CMU_DAPCLKCTRL_CLKSEL_HFRCODPLL            (_CMU_DAPCLKCTRL_CLKSEL_HFRCODPLL << 0) /**< Shifted mode HFRCODPLL for CMU_DAPCLKCTRL   */

/* Bit fields for CMU LESENSEHFCLKCTRL */
#define _CMU_LESENSEHFCLKCTRL_RESETVALUE           0x00000001UL                                  /**< Default value for CMU_LESENSEHFCLKCTRL      */
#define _CMU_LESENSEHFCLKCTRL_MASK                 0x00000003UL                                  /**< Mask for CMU_LESENSEHFCLKCTRL               */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_SHIFT         0                                             /**< Shift value for CMU_CLKSEL                  */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_MASK          0x3UL                                         /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_DEFAULT       0x00000001UL                                  /**< Mode DEFAULT for CMU_LESENSEHFCLKCTRL       */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO         0x00000001UL                                  /**< Mode FSRCO for CMU_LESENSEHFCLKCTRL         */
#define _CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23     0x00000002UL                                  /**< Mode HFRCOEM23 for CMU_LESENSEHFCLKCTRL     */
#define CMU_LESENSEHFCLKCTRL_CLKSEL_DEFAULT        (_CMU_LESENSEHFCLKCTRL_CLKSEL_DEFAULT << 0)   /**< Shifted mode DEFAULT for CMU_LESENSEHFCLKCTRL*/
#define CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO          (_CMU_LESENSEHFCLKCTRL_CLKSEL_FSRCO << 0)     /**< Shifted mode FSRCO for CMU_LESENSEHFCLKCTRL */
#define CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23      (_CMU_LESENSEHFCLKCTRL_CLKSEL_HFRCOEM23 << 0) /**< Shifted mode HFRCOEM23 for CMU_LESENSEHFCLKCTRL*/

/* Bit fields for CMU USB0CLKCTRL */
#define _CMU_USB0CLKCTRL_RESETVALUE                0x00000001UL                           /**< Default value for CMU_USB0CLKCTRL           */
#define _CMU_USB0CLKCTRL_MASK                      0x00000003UL                           /**< Mask for CMU_USB0CLKCTRL                    */
#define _CMU_USB0CLKCTRL_CLKSEL_SHIFT              0                                      /**< Shift value for CMU_CLKSEL                  */
#define _CMU_USB0CLKCTRL_CLKSEL_MASK               0x3UL                                  /**< Bit mask for CMU_CLKSEL                     */
#define _CMU_USB0CLKCTRL_CLKSEL_DEFAULT            0x00000001UL                           /**< Mode DEFAULT for CMU_USB0CLKCTRL            */
#define _CMU_USB0CLKCTRL_CLKSEL_PLL0               0x00000001UL                           /**< Mode PLL0 for CMU_USB0CLKCTRL               */
#define _CMU_USB0CLKCTRL_CLKSEL_LFXO               0x00000002UL                           /**< Mode LFXO for CMU_USB0CLKCTRL               */
#define _CMU_USB0CLKCTRL_CLKSEL_LFRCO              0x00000003UL                           /**< Mode LFRCO for CMU_USB0CLKCTRL              */
#define CMU_USB0CLKCTRL_CLKSEL_DEFAULT             (_CMU_USB0CLKCTRL_CLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_USB0CLKCTRL    */
#define CMU_USB0CLKCTRL_CLKSEL_PLL0                (_CMU_USB0CLKCTRL_CLKSEL_PLL0 << 0)    /**< Shifted mode PLL0 for CMU_USB0CLKCTRL       */
#define CMU_USB0CLKCTRL_CLKSEL_LFXO                (_CMU_USB0CLKCTRL_CLKSEL_LFXO << 0)    /**< Shifted mode LFXO for CMU_USB0CLKCTRL       */
#define CMU_USB0CLKCTRL_CLKSEL_LFRCO               (_CMU_USB0CLKCTRL_CLKSEL_LFRCO << 0)   /**< Shifted mode LFRCO for CMU_USB0CLKCTRL      */

/** @} End of group EFR32FG25_CMU_BitFields */
/** @} End of group EFR32FG25_CMU */
/** @} End of group Parts */

#endif /* EFR32FG25_CMU_H */
